iot-bus/moddable/modules/pins/spi/esp32/modSPI.c
/*
 * Copyright (c) 2016-2019  Moddable Tech, Inc.
 *
 *   This file is part of the Moddable SDK Runtime.
 * 
 *   The Moddable SDK Runtime is free software: you can redistribute it and/or modify
 *   it under the terms of the GNU Lesser General Public License as published by
 *   the Free Software Foundation, either version 3 of the License, or
 *   (at your option) any later version.
 * 
 *   The Moddable SDK Runtime is distributed in the hope that it will be useful,
 *   but WITHOUT ANY WARRANTY; without even the implied warranty of
 *   MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *   GNU Lesser General Public License for more details.
 * 
 *   You should have received a copy of the GNU Lesser General Public License
 *   along with the Moddable SDK Runtime.  If not, see <http://www.gnu.org/licenses/>.
 *
 */

#include "xsesp.h"

#include <string.h>
#include <stdlib.h>
#include <errno.h>
#include "modSPI.h"
#include "mc.defines.h"

#include "esp_attr.h"		// IRAM_ATTR
#include "esp_heap_caps.h"	// MALLOC_CAP_DMA, heap_caps_malloc

// added for hal-spi
#include "esp32-hal-spi.h"

#ifndef MODDEF_SPI_MISO_PIN
	#define MODDEF_SPI_MISO_PIN	12
#endif
#ifndef MODDEF_SPI_MOSI_PIN
	#define MODDEF_SPI_MOSI_PIN	13
#endif
#ifndef MODDEF_SPI_SCK_PIN
	#define MODDEF_SPI_SCK_PIN	14
#endif

typedef uint16_t (*modSPIBufferLoader)(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);

static uint16_t modSpiLoadBufferAsIs(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);
static uint16_t modSpiLoadBufferSwap16(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);
static uint16_t modSpiLoadBufferRGB565LEtoRGB444(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);
static uint16_t modSpiLoadBufferRGB332To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);
static uint16_t modSpiLoadBufferGray256To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);
static uint16_t modSpiLoadBufferGray16To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut);

static modSPIConfiguration gConfig;
static uint8_t *gSPIData;
static volatile int16_t gSPIDataCount = -1;
static modSPIBufferLoader gSPIBufferLoader;
static uint16_t *gCLUT16;		//@@ unused

static spi_transaction_t gTransaction[2];
static uint8_t gTransactionIndex = 0;
static uint8_t gTransactionsPending = 0;

// adds for hal-spi
spi_t * _spi;
int8_t _spi_number = VSPI;
uint32_t _div;
uint32_t _freq;
bool _inTransaction;
// end of adds

// SPI_BUFFER_SIZE can be larger than 64... tested up to 512.
#define SPI_BUFFER_SIZE (512)

// The SPI driver may decide to use DMA for transfers, so these buffers should
// be allocated in DMA-capable memory using heap_caps_malloc(size, MALLOC_CAP_DMA).
//static uint32_t gSPITransactionBuffer[SPI_BUFFER_SIZE / sizeof(uint32_t)];
uint32_t *gSPITransactionBuffer = NULL;


// void IRAM_ATTR reduceTransactionsPending(uint8_t min)
// {
// 	while (gTransactionsPending > min) {
// 		spi_transaction_t *ret_trans;

// 		spi_device_get_trans_result(gConfig->spi_dev, &ret_trans, portMAX_DELAY);

// 		gTransactionsPending -= 1;
// 	}
// }


// IAN - TODO this needs the most work

// queue up the next one
// static void IRAM_ATTR postTransfer(spi_transaction_t *transIn)
// {
//     esp_err_t ret;
// 	spi_transaction_t *trans;
// 	uint16_t loaded, bitsOut;

// 	if (gSPIDataCount <= 0) {
// 		gSPIDataCount = -1;
// 		gSPIData = NULL;
// 		return;
// 	}

// 	loaded = (gSPIBufferLoader)(gSPIData, (gSPIDataCount <= SPI_BUFFER_SIZE) ? gSPIDataCount : SPI_BUFFER_SIZE, &bitsOut);
// 	gSPIDataCount -= loaded;
// 	gSPIData += loaded;

// 	trans = &gTransaction[gTransactionIndex];
// 	gTransactionIndex ^= 1;

// 	trans->flags = 0;
// 	trans->cmd = 0;
// 	trans->addr = 0;
// 	trans->length = bitsOut;
// 	trans->rxlength = 0;
// 	trans->user = 0;
// 	trans->tx_buffer = gSPITransactionBuffer;
// 	trans->rx_buffer = NULL;

// 	gTransactionsPending += 1;

//     ret = spi_device_queue_trans(gConfig->spi_dev, trans, portMAX_DELAY);

// 	reduceTransactionsPending(2);
// }

static uint8_t gSPIInited;

// void modSPIInit(modSPIConfiguration config)
// {
// 	esp_err_t ret;

// 	if (!gSPIInited) {
// 		spi_bus_config_t buscfg;

// 		gSPITransactionBuffer = heap_caps_malloc(SPI_BUFFER_SIZE, MALLOC_CAP_DMA);

// 		memset(&buscfg, 0, sizeof(buscfg));
// 		buscfg.miso_io_num = MODDEF_SPI_MISO_PIN;
// 		buscfg.mosi_io_num = MODDEF_SPI_MOSI_PIN;
// 		buscfg.sclk_io_num = MODDEF_SPI_SCK_PIN;
// 		buscfg.quadwp_io_num = -1;
// 		buscfg.quadhd_io_num = -1;

// 		ret = spi_bus_initialize(config->spiPort, &buscfg, 1);
// 		if (ret) return;
// 		gSPIInited = 1;
// 		gSPIData = NULL;
// 		gSPIDataCount = -1;
// 	}

// 	spi_device_interface_config_t devcfg;
// 	memset(&devcfg, 0, sizeof(devcfg));
// 	devcfg.clock_speed_hz = config->hz;
// 	devcfg.mode = 0;
// 	devcfg.spics_io_num = config->cs_pin;		// set to -1 if none
// 	devcfg.queue_size = 3;
// 	devcfg.pre_cb = NULL;
// 	devcfg.post_cb = postTransfer;

// 	ret = spi_bus_add_device(config->spiPort, &devcfg, &config->spi_dev);
// 	if (ret) {
// 		printf("spi_bus_add_device failed %d\n", ret);
// 		return;
// 	}
// }

void modSPIInit(modSPIConfiguration config)
{
	gpio_set_direction(config->cs_pin, GPIO_MODE_OUTPUT);
    gpio_set_level(config->cs_pin, 1);

    if(_spi) {
		printf("In modSPIInit, SPI already started\n");
        return;
    }
	else{
        printf("In modSPIInit, starting SPI\n");
    }

    if(!_div) {
        _div = spiFrequencyToClockDiv(40*1000*1000);
    }

    _spi = spiStartBus(_spi_number, _div, SPI_MODE0, SPI_MSBFIRST);
    if(!_spi) {
        return;
    }

    spiAttachSCK(_spi, MODDEF_SPI_SCK_PIN);
    spiAttachMISO(_spi, MODDEF_SPI_MISO_PIN);
    spiAttachMOSI(_spi, MODDEF_SPI_MOSI_PIN);

	gSPIInited = 1;
	gSPIData = NULL;
	gSPIDataCount = -1;
	gSPITransactionBuffer = heap_caps_malloc(SPI_BUFFER_SIZE, MALLOC_CAP_DMA);
}

// void modSPIUninit(modSPIConfiguration config)
// {
// 	if (config == gConfig)
// 		modSPIActivateConfiguration(NULL);

// //@@ should only be done on last SPI client closing
// 	if (config->spi_dev)
// 		spi_bus_remove_device(config->spi_dev);

// 	free(gSPITransactionBuffer);
// 	gSPITransactionBuffer = NULL;
// 	config->spi_dev = NULL;
// }

void modSPIUninit(modSPIConfiguration config)
{
	if (config == gConfig)
		modSPIActivateConfiguration(NULL);

	free(gSPITransactionBuffer);
	gSPITransactionBuffer = NULL;

    if(!_spi) {
        return;
    }
    spiDetachSCK(_spi, MODDEF_SPI_SCK_PIN);
    spiDetachMISO(_spi, MODDEF_SPI_MISO_PIN);
    spiDetachMOSI(_spi, MODDEF_SPI_MOSI_PIN);
//    setHwCs(false);
    spiStopBus(_spi);
    _spi = NULL;
}

void modSPIActivateConfiguration(modSPIConfiguration config)
{
	modSPIFlush();

	if (config == gConfig)
		return;

	if (gConfig)
		(gConfig->doChipSelect)(0, gConfig);

	gConfig = config;
	if (gConfig)
		(gConfig->doChipSelect)(1, gConfig);
}

// data must be long aligned
uint16_t IRAM_ATTR modSpiLoadBufferAsIs(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint32_t *from = (uint32_t *)data, *to = gSPITransactionBuffer;
	uint8_t longs;
	uint16_t result = bytes;

	*bitsOut = bytes << 3;

	while (bytes >= 64) {
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		*to++ = *from++;
		bytes -= 64;
	}

	longs = (bytes + 3) >> 2;
	while (longs--)
		*to++ = *from++;

	return result;
}

uint16_t IRAM_ATTR modSpiLoadBufferSwap16(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint32_t *from = (uint32_t *)data;
	uint32_t *to = gSPITransactionBuffer;
	const uint32_t mask = 0x00ff00ff;
	uint32_t twoPixels;
	uint16_t result = bytes;
	uint8_t longs;

	*bitsOut = bytes << 3;

	while (bytes >= 64) {
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
		bytes -= 64;
	}

	longs = (bytes + 3) >> 2;
	while (longs--) {
		twoPixels = *from++; *to++ = ((twoPixels & mask) << 8) | ((twoPixels >> 8) & mask);
	}

	return result;

}

uint16_t IRAM_ATTR modSpiLoadBufferRGB565LEtoRGB444(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint16_t *from = (uint16_t *)data;
	uint8_t *to = (uint8_t *)gSPITransactionBuffer;
	uint16_t remain;

	if (bytes > SPI_BUFFER_SIZE)
		bytes = SPI_BUFFER_SIZE;

	*bitsOut = (bytes >> 1) * 12;

	remain = bytes >> 2;
	while (remain--) {
		uint8_t r, g, b;
		uint16_t rgb565 = *from++;
		r = rgb565 >> 12, g = (rgb565 >> 7) & 0x0F, b = (rgb565 >> 1) & 0x0F;
		*to++ = (r << 4) | g;

		rgb565 = *from++;
		r = rgb565 >> 12;
		*to++ = (b << 4) | r;
		g = (rgb565 >> 7) & 0x0F, b = (rgb565 >> 1) & 0x0F;
		*to++ = (g << 4) | b;
	}

	if (bytes & 2) {
		uint8_t r, g, b;
		uint16_t rgb565 = *from;
		r = rgb565 >> 12, g = (rgb565 >> 7) & 0x0F, b = (rgb565 >> 1) & 0x0F;
		*to++ = (r << 4) | g;
		*to = b << 4;
	}

	return bytes;		// input bytes consumed
}

uint16_t IRAM_ATTR modSpiLoadBufferRGB332To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint8_t *from = (uint8_t *)data;
	uint32_t *to = gSPITransactionBuffer;
	uint16_t remain;

	if (bytes > (SPI_BUFFER_SIZE >> 1))
		bytes = SPI_BUFFER_SIZE >> 1;

	*bitsOut = bytes << 4;		// output bits are double input bits

	remain = bytes;
	while (remain >= 2) {
		uint8_t rgb332, r, g, b;
		uint16_t pixela, pixelb;

		rgb332 = *from++;
		r = rgb332 >> 5, g = (rgb332 >> 2) & 0x07, b = rgb332 & 0x03;
		r = (r << 2) | (r >> 2), g |= g << 3, b = (b << 3) | (b << 1) | (b >> 1);
		pixela = (r << 11) | (g << 5) | b;
		pixela = (pixela >> 8) | (pixela << 8);

		rgb332 = *from++;
		r = rgb332 >> 5, g = (rgb332 >> 2) & 0x07, b = rgb332 & 0x03;
		r = (r << 2) | (r >> 2), g |= g << 3, b = (b << 3) | (b << 1) | (b >> 1);
		pixelb = (r << 11) | (g << 5) | b;
		pixelb = (pixelb >> 8) | (pixelb << 8);

		*to++ = (pixelb << 16) | pixela;
		remain -= 2;
	}

	if (remain) {
		uint16_t pixela;
		uint8_t rgb332 = *from++, r, g, b;
		r = rgb332 >> 5, g = (rgb332 >> 2) & 0x07, b = rgb332 & 0x03;
		r = (r << 2) | (r >> 2), g |= g << 3, b = (b << 3) | (b << 1) | (b >> 1);
		pixela = (r << 11) | (g << 5) | b;
		pixela = (pixela >> 8) | (pixela << 8);
		*to++ = (0 << 16) | pixela;
	}

	return bytes;		// input bytes consumed
}

uint16_t IRAM_ATTR modSpiLoadBufferGray256To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint8_t *from = (uint8_t *)data;
	uint32_t *to = gSPITransactionBuffer;
	uint16_t remain;

	if (bytes > (SPI_BUFFER_SIZE >> 1))
		bytes = SPI_BUFFER_SIZE >> 1;

	*bitsOut = bytes << 4;		// output bits are double input bits

	remain = bytes;
	while (remain >= 2) {
		uint8_t gray;
		uint16_t pixela, pixelb;

		gray = *from++;
		pixela = ((gray >> 3) << 11) | ((gray >> 2) << 5) | (gray >> 3);
		pixela = (pixela >> 8) | (pixela << 8);

		gray = *from++;
		pixelb = ((gray >> 3) << 11) | ((gray >> 2) << 5) | (gray >> 3);
		pixelb = (pixelb >> 8) | (pixelb << 8);

		*to++ = (pixelb << 16) | pixela;
		remain -= 2;
	}

	if (remain) {
		uint8_t gray = *from++;
		uint16_t pixela = ((gray >> 3) << 11) | ((gray >> 2) << 5) | (gray >> 3);
		pixela = (pixela >> 8) | (pixela << 8);
		*to++ = (0 << 16) | pixela;
	}

	return bytes;		// input bytes consumed
}

uint16_t IRAM_ATTR modSpiLoadBufferGray16To16BE(uint8_t *data, uint16_t bytes, uint16_t *bitsOut)
{
	uint8_t *from = (uint8_t *)data;
	uint32_t *to = gSPITransactionBuffer;
	uint16_t i;

	if (bytes > (SPI_BUFFER_SIZE >> 2))
		bytes = SPI_BUFFER_SIZE >> 2;
	*bitsOut = bytes << 5;		// output bits are quadruple input bits

	for (i = 0; i < bytes; i++) {
		uint8_t gray;
		uint8_t twoPixels = *from++;
		uint16_t pixela, pixelb;

		gray = (twoPixels >> 2) & 0x3C;
		gray |= gray >> 4;				// 6 bits of gray
		pixela = gray >> 1;				// 5 bita of gray
		pixela |= (pixela << 11) | (gray << 5);
		pixela = (pixela >> 8) | (pixela << 8);

		gray = (twoPixels << 2) & 0x3C;
		gray |= gray >> 4;
		pixelb = gray >> 1;
		pixelb |= (pixelb << 11) | (gray << 5);
		pixelb = (pixelb >> 8) | (pixelb << 8);

		*to++ = (pixelb << 16) | pixela;
	}

	return bytes;		// input bytes consumed
}

// N.B. callers assume this funtion is synchronous
// void modSPITxRx(modSPIConfiguration config, uint8_t *data, uint16_t count)
// {
// 	esp_err_t ret;
// 	spi_transaction_t t;

// 	modSPIActivateConfiguration(config);

// 	memset(&t, 0, sizeof(t));
// 	t.length = 8 * count;
// 	t.tx_buffer = data;

// 	t.rxlength = t.length;
// 	t.rx_buffer = data;
// 	ret = spi_device_transmit(config->spi_dev, &t);

// 	if (0 > ret)
// 		printf("problems sending spi message: ret: %d\n", ret);
// }

// N.B. callers assume this function is synchronous
void modSPITxRx(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	//esp_err_t ret;
	//spi_transaction_t t;

	modSPIActivateConfiguration(config);

    gpio_set_level(config->cs_pin, 0);
	modSPISetFrequency(config->hz);
	modSPITransfer(data, count);
	gpio_set_level(config->cs_pin, 1);

	// memset(&t, 0, sizeof(t));
	// t.length = 8 * count;
	// t.tx_buffer = data;

	// t.rxlength = t.length;
	// t.rx_buffer = data;
	// ret = spi_device_transmit(config->spi_dev, &t);

	// if (0 > ret)
	// 	printf("problems sending spi message: ret: %d\n", ret);
}

// void modSPIFlush(void)
// {
// 	while (gSPIDataCount >= 0)
// 		;

// 	reduceTransactionsPending(0);
// }

void modSPIFlush(void)
{
	// while (gSPIDataCount >= 0)
	// 	;

	// reduceTransactionsPending(0);
}

// static void modSPITxCommon(modSPIConfiguration config, uint8_t *data, uint16_t count, modSPIBufferLoader loader)
// {
// 	modSPIActivateConfiguration(config);

// 	gSPIBufferLoader = loader;
// 	gSPIData = data;
// 	gSPIDataCount = count;

// 	postTransfer(NULL);

// 	if (config->sync)
// 		modSPIFlush();
// }

// static void modSPITxCommon(modSPIConfiguration config, uint8_t *data, uint16_t count, modSPIBufferLoader loader)
// {
// 	modSPIActivateConfiguration(config);

// 	gSPIBufferLoader = loader;
// 	gSPIData = data;
// 	gSPIDataCount = count;

// 	postTransfer(NULL);

// 	if (config->sync)
// 		modSPIFlush();
// }

static void modSPITxCommon(modSPIConfiguration config, uint8_t *data, uint16_t count, modSPIBufferLoader loader)
{
	modSPIActivateConfiguration(config);

	gSPIBufferLoader = loader;
	gSPIData = data;
	gSPIDataCount = count;

	uint16_t loaded, bitsOut;

	if (gSPIDataCount <= 0) {
		gSPIDataCount = -1;
		gSPIData = NULL;
		return;
	}
    // IAN - oddWires - this needs updating if more data than buffer can hold
	loaded = (gSPIBufferLoader)(gSPIData, (gSPIDataCount <= SPI_BUFFER_SIZE) ? gSPIDataCount : SPI_BUFFER_SIZE, &bitsOut);
	gSPIDataCount -= loaded;
	gSPIData += loaded;

    modSPISetFrequency(config->hz);
    gpio_set_level(config->cs_pin, 0);
	modSPIWriteBytes((uint8_t*)gSPITransactionBuffer, bitsOut/8);
    gpio_set_level(config->cs_pin, 1);
}

void modSPITx(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferAsIs);
}

void modSPITxSwap16(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferSwap16);
}

void modSPITxRGB565LEtoRGB444(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferRGB565LEtoRGB444);
}

void modSPITxRGB332To16BE(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferRGB332To16BE);
}

void modSPITxGray256To16BE(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferGray256To16BE);
}

void modSPITxGray16To16BE(modSPIConfiguration config, uint8_t *data, uint16_t count)
{
	modSPITxCommon(config, data, count, modSpiLoadBufferGray16To16BE);
}

void modSPITxCLUT16To16BE(modSPIConfiguration config, uint8_t *data, uint16_t count, uint16_t *colors)
{
//	gCLUT16 = colors;
//	modSPITxCommon(config, data, count, modSpiLoadBufferGray16To16BE);
	printf("need to implement CLUT16to16BE\n");
}


// Added for Arduino hal-spi

void modSPITransfer(uint8_t * data, uint32_t size) 
{ 
    modSPITransferBytes(data, data, size); 
}

/**
 * @param data uint8_t * data buffer. can be NULL for Read Only operation
 * @param out  uint8_t * output buffer. can be NULL for Write Only operation
 * @param size uint32_t
 */
void modSPITransferBytes(uint8_t * data, uint8_t * out, uint32_t size)
{
    if(_inTransaction){
        return spiTransferBytesNL(_spi, data, out, size);
    }
    spiTransferBytes(_spi, data, out, size);
}

/**
 * @param data uint8_t *
 * @param size uint32_t
 */
void modSPIWriteBytes(uint8_t * data, uint32_t size)
{
    if(_inTransaction){
        return spiWriteNL(_spi, data, size);
    }
    spiSimpleTransaction(_spi);
    spiWriteNL(_spi, data, size);
    spiEndTransaction(_spi);
}

void modSPISetFrequency(uint32_t freq)
{
    //check if last freq changed
    uint32_t cdiv = spiGetClockDiv(_spi);
    if(_freq != freq || _div != cdiv) {
        _freq = freq;
        _div = spiFrequencyToClockDiv(_freq);
        spiSetClockDiv(_spi, _div);
    }
}
